In [1]:
import pandas as pd

In [3]:
# read a dataset of movie reviewers (modifying the default parameter values for read_table)
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols,index_col='user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [4]:
users.shape

(943, 4)

In [5]:
users.zip_code.duplicated() #True if zip code was true for an above user

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940     True
941    False
942    False
943    False
Name: zip_code, Length: 943, dtype: bool

In [6]:
users.zip_code.duplicated().sum() #True=1 all added

148

In [16]:
users.duplicated()

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940    False
941    False
942    False
943    False
Length: 943, dtype: bool

In [15]:
users.duplicated().sum() #rows having duplication

7

In [18]:
users.loc[users.duplicated(keep='first'),:] #keeps the first copy

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [19]:
users.loc[users.duplicated(keep='last'),:] #keeps the last copy

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630

In [24]:
users.loc[users.duplicated(keep=False),:] #marks all duplicates as tru

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [26]:
users.drop_duplicates(keep='first').shape

(936, 4)

In [27]:
users.drop_duplicates(keep='last').shape

(936, 4)

In [28]:
users.drop_duplicates(keep=False).shape

(929, 4)

In [31]:
users.duplicated(subset=['age','zip_code']).sum() #duplications based on age and zip code only

16

In [33]:
users.drop_duplicates(subset=['age','zip_code'],keep=False)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[911 rows x 4 columns]